demo/app/controllers/to_dos_controller.rb

  def index

    @data = {
      :to_do => ToDo.first.to_json
---
SELECT * FROM "to_dos"

  def show
    @to_do = ToDo.find(params[:id])
---
SELECT * FROM "to_dos" WHERE ("to_dos"."id" = 1)

  def create
    @to_do = ToDo.new(params[:to_do])

    respond_to do |format|
      if @to_do.save
---
INSERT INTO "to_dos" ("created_at", "title", "updated_at", "priority") VALUES('2010-07-14 07:17:08', 'spank my monkey', '2010-07-14 07:17:08', 222222)